{"backend": "tensorflow", "keras_version": "2.1.1", "config": [{"config": {"activity_regularizer": null, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "dtype": "float32", "trainable": false, "input_dim": 20000, "input_length": 1000, "embeddings_regularizer": null, "name": "embedding_1", "mask_zero": false, "output_dim": 25, "embeddings_constraint": null, "batch_input_shape": [null, 1000]}, "class_name": "Embedding"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1], "filters": 256, "trainable": true, "use_bias": true, "kernel_size": [5], "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "strides": [1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv1d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"strides": [5], "trainable": true, "name": "average_pooling1d_1", "padding": "valid", "pool_size": [5]}, "class_name": "AveragePooling1D"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1], "filters": 128, "trainable": true, "use_bias": true, "kernel_size": [5], "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "strides": [1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv1d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"strides": [5], "trainable": true, "name": "average_pooling1d_2", "padding": "valid", "pool_size": [5]}, "class_name": "AveragePooling1D"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1], "filters": 64, "trainable": true, "use_bias": true, "kernel_size": [5], "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "strides": [1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv1d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"strides": [5], "trainable": true, "name": "max_pooling1d_1", "padding": "valid", "pool_size": [5]}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "global_max_pooling1d_1"}, "class_name": "GlobalMaxPooling1D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 64, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1", "activation": "relu"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 2, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_2", "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}